In [1]:
import pandas
pandas.__version__

'1.0.5'

In [2]:
import numpy as np
import pandas as pd

In [3]:
counts=pd.Series([150,700,1222,358,108])
counts

0     150
1     700
2    1222
3     358
4     108
dtype: int64

In [4]:
counts.values

array([ 150,  700, 1222,  358,  108], dtype=int64)

In [5]:
counts.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
colours=pd.Series([150,700,1222,358,108],
    index=['Red','Blue','Purple','Black','Green'])
    
print(colours)

Red        150
Blue       700
Purple    1222
Black      358
Green      108
dtype: int64

In [7]:
colours['Purple']

1222

In [8]:
colours[3]

358

In [9]:
colours.index.name='dark'
colours.name='counts'
colours

dark
Red        150
Blue       700
Purple    1222
Black      358
Green      108
Name: counts, dtype: int64

In [10]:
np.log(colours)

dark
Red       5.010635
Blue      6.551080
Purple    7.108244
Black     5.880533
Green     4.682131
Name: counts, dtype: float64

In [11]:
colours[colours > 500]

dark
Blue       700
Purple    1222
Name: counts, dtype: int64

In [12]:
colours_dict={'Red':150,'Blue':700,'Purple':1222,'Black':358,'Green':108}
print(colours_dict)
pd.Series(colours_dict)

{'Red': 150, 'Blue': 700, 'Purple': 1222, 'Black': 358, 'Green': 108}

Red        150
Blue       700
Purple    1222
Black      358
Green      108
dtype: int64

In [47]:
data={'Names':['Ria','Banu','Priya','Gita','Varsha'],
      'Roll_no':[101,104,102,105,103],
      'Marks':[56,78,24,67,89]}
print(data)
data=pd.DataFrame(data)
print(data)

{'Names': ['Ria', 'Banu', 'Priya', 'Gita', 'Varsha'], 'Roll_no': [101, 104, 102, 105, 103], 'Marks': [56, 78, 24, 67, 89]}
    Names  Roll_no  Marks
0     Ria      101     56
1    Banu      104     78
2   Priya      102     24
3    Gita      105     67
4  Varsha      103     89

In [48]:
df=pd.DataFrame(data,columns=['Roll_no','Names','Marks'])
df

   Roll_no   Names  Marks
0      101     Ria     56
1      104    Banu     78
2      102   Priya     24
3      105    Gita     67
4      103  Varsha     89

In [49]:
df['Paper']=df.Roll_no / df.Marks
df

   Roll_no   Names  Marks     Paper
0      101     Ria     56  1.803571
1      104    Banu     78  1.333333
2      102   Priya     24  4.250000
3      105    Gita     67  1.567164
4      103  Varsha     89  1.157303

In [50]:
df['Series_aligned']=pd.Series(range(5),index=[0,1,2,3,4])
df

   Roll_no   Names  Marks     Paper  Series_aligned
0      101     Ria     56  1.803571               0
1      104    Banu     78  1.333333               1
2      102   Priya     24  4.250000               2
3      105    Gita     67  1.567164               3
4      103  Varsha     89  1.157303               4

In [51]:
df.to_dict()

{'Roll_no': {0: 101, 1: 104, 2: 102, 3: 105, 4: 103},
 'Names': {0: 'Ria', 1: 'Banu', 2: 'Priya', 3: 'Gita', 4: 'Varsha'},
 'Marks': {0: 56, 1: 78, 2: 24, 3: 67, 4: 89},
 'Paper': {0: 1.8035714285714286,
  1: 1.3333333333333333,
  2: 4.25,
  3: 1.5671641791044777,
  4: 1.1573033707865168},
 'Series_aligned': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4}}

In [18]:
pd.DataFrame(df.to_dict())

   Roll_no   Names  Marks     Paper  Series_aligned
0      101     Ria     56  1.803571               0
1      104    Banu     78  1.333333               1
2      102   Priya     24  4.250000               2
3      105    Gita     67  1.567164               3
4      103  Varsha     89  1.157303               4

In [19]:
data=[{'a':j,'b':5*j} for j in range(8)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 5}, {'a': 2, 'b': 10}, {'a': 3, 'b': 15}, {'a': 4, 'b': 20}, {'a': 5, 'b': 25}, {'a': 6, 'b': 30}, {'a': 7, 'b': 35}]

   a   b
0  0   0
1  1   5
2  2  10
3  3  15
4  4  20
5  5  25
6  6  30
7  7  35

In [20]:
pd.DataFrame([{'ml':1,'dp':2},{'dp':2,'eh':5,'ot':8}])

    ml  dp   eh   ot
0  1.0   2  NaN  NaN
1  NaN   2  5.0  8.0

In [21]:
df=pd.DataFrame([{'ml':1,'dp':2},{'dp':2,'eh':5,'ot':8}])
df=df.to_dict()
print(df)

{'ml': {0: 1.0, 1: nan}, 'dp': {0: 2, 1: 2}, 'eh': {0: nan, 1: 5.0}, 'ot': {0: nan, 1: 8.0}}

In [22]:
pd.DataFrame(np.random.randint(3,10),
             columns=['dash','tab','map'],
             index=['abc','xyz','pqr'])

     dash  tab  map
abc     7    7    7
xyz     7    7    7
pqr     7    7    7

In [23]:
pd.DataFrame(np.random.randint(3,10),
             columns=['dash','tab','map'],
             index=['abc','xyz','pqr'])

     dash  tab  map
abc     9    9    9
xyz     9    9    9
pqr     9    9    9

In [24]:
ind=pd.Index([5,34,11,19,2,55,29])
ind

Int64Index([5, 34, 11, 19, 2, 55, 29], dtype='int64')

In [25]:
ind[4]

2

In [26]:
ind[:]

Int64Index([5, 34, 11, 19, 2, 55, 29], dtype='int64')

In [27]:
ind[::]

Int64Index([5, 34, 11, 19, 2, 55, 29], dtype='int64')

In [28]:
ind[1:5:3]

Int64Index([34, 2], dtype='int64')

In [29]:
print(ind.size, ind.ndim, ind.shape, ind.dtype)

7 1 (7,) int64

In [30]:
reg=np.random.RandomState(15)
ser=pd.Series(reg.randint(0,10,4))
ser

0    8
1    5
2    5
3    7
dtype: int32

In [31]:
reg=np.random.RandomState(20)
ser=pd.Series(reg.randint(0,10,15))
ser

0     3
1     9
2     4
3     6
4     7
5     2
6     0
7     6
8     8
9     5
10    3
11    0
12    6
13    6
14    0
dtype: int32

In [32]:
jum = pd.DataFrame(reg.randint(0, 10, (5,4)),
                  columns=['z', 'X', 'W', 'y'])
jum

   z  X  W  y
0  9  5  7  5
1  2  6  9  3
2  3  9  0  6
3  2  3  1  8
4  0  2  7  6

In [33]:
np.exp(ser)

0       20.085537
1     8103.083928
2       54.598150
3      403.428793
4     1096.633158
5        7.389056
6        1.000000
7      403.428793
8     2980.957987
9      148.413159
10      20.085537
11       1.000000
12     403.428793
13     403.428793
14       1.000000
dtype: float64

In [34]:
np.sin(jum*np.pi/5)

          z             X         W             y
0 -0.587785  1.224647e-16 -0.951057  1.224647e-16
1  0.951057 -5.877853e-01 -0.587785  9.510565e-01
2  0.951057 -5.877853e-01  0.000000 -5.877853e-01
3  0.951057  9.510565e-01  0.587785 -9.510565e-01
4  0.000000  9.510565e-01 -0.951057 -5.877853e-01

In [35]:
area=pd.Series({'Karnataka':467894, 'Goa':167548, 'Telangana':365787}, name='area')

population=pd.Series({'Gujarat':577652, 'Kerala':356576, 'Goa':244567}, name='population')

print(area)

print(population)

Karnataka    467894
Goa          167548
Telangana    365787
Name: area, dtype: int64
Gujarat    577652
Kerala     356576
Goa        244567
Name: population, dtype: int64

In [36]:
population/area

Goa          1.459683
Gujarat           NaN
Karnataka         NaN
Kerala            NaN
Telangana         NaN
dtype: float64

In [37]:
area.index | population.index

Index(['Goa', 'Gujarat', 'Karnataka', 'Kerala', 'Telangana'], dtype='object')

In [38]:
x=pd.Series([5,3,8,0], index=[1,2,3,4])
y=pd.Series([9,2,2,1], index=[0,1,2,3])
print(x)
print(y)

1    5
2    3
3    8
4    0
dtype: int64
0    9
1    2
2    2
3    1
dtype: int64

In [39]:
x + y

0    NaN
1    7.0
2    5.0
3    9.0
4    NaN
dtype: float64

In [40]:
x.add(y,fill_value=0)

0    9.0
1    7.0
2    5.0
3    9.0
4    0.0
dtype: float64

In [56]:
print(df)

   Roll_no   Names  Marks     Paper  Series_aligned
0      101     Ria     56  1.803571               0
1      104    Banu     78  1.333333               1
2      102   Priya     24  4.250000               2
3      105    Gita     67  1.567164               3
4      103  Varsha     89  1.157303               4

In [61]:
df2=pd.DataFrame({'Names':['Gita','Banu','Varsha'],'Project_no':[105,87,34]})
df2

    Names  Project_no
0    Gita         105
1    Banu          87
2  Varsha          34

In [62]:
df.merge(df2)

   Roll_no   Names  Marks     Paper  Series_aligned  Project_no
0      104    Banu     78  1.333333               1          87
1      105    Gita     67  1.567164               3         105
2      103  Varsha     89  1.157303               4          34

In [63]:
df3=pd.DataFrame({'names':['Varsha','Gita'],'Project_no':[105,34]})
df3

    names  Project_no
0  Varsha         105
1    Gita          34

In [64]:
df.merge(df3,right_on='names',left_on='Names')

   Roll_no   Names  Marks     Paper  Series_aligned   names  Project_no
0      105    Gita     67  1.567164               3    Gita          34
1      103  Varsha     89  1.157303               4  Varsha         105

In [65]:
df4=pd.DataFrame({'Names':['Ria','Gita','Sita'],'Project_no':[105,34,90]})
df4

  Names  Project_no
0   Ria         105
1  Gita          34
2  Sita          90

In [67]:
df.merge(df4,how='outer')

   Roll_no   Names  Marks     Paper  Series_aligned  Project_no
0    101.0     Ria   56.0  1.803571             0.0       105.0
1    104.0    Banu   78.0  1.333333             1.0         NaN
2    102.0   Priya   24.0  4.250000             2.0         NaN
3    105.0    Gita   67.0  1.567164             3.0        34.0
4    103.0  Varsha   89.0  1.157303             4.0         NaN
5      NaN    Sita    NaN       NaN             NaN        90.0

In [69]:
df5=pd.DataFrame({'Names':['Ria','Gita','Ria'],'Project_no':[105,34,90]})
df5

  Names  Project_no
0   Ria         105
1  Gita          34
2   Ria          90

In [70]:
df.merge(df5,how='outer')

   Roll_no   Names  Marks     Paper  Series_aligned  Project_no
0      101     Ria     56  1.803571               0       105.0
1      101     Ria     56  1.803571               0        90.0
2      104    Banu     78  1.333333               1         NaN
3      102   Priya     24  4.250000               2         NaN
4      105    Gita     67  1.567164               3        34.0
5      103  Varsha     89  1.157303               4         NaN

In [71]:
serie_a=pd.Series([np.nan,5.0,2.0,np.nan,np.nan,9.0],
                   index=['b','d','a','c','f','e'])
serie_b=pd.Series(np.arange(len(serie_a),dtype=np.float64),
                  index=['b','d','a','c','f','e'])

In [72]:
print(serie_a)

b    NaN
d    5.0
a    2.0
c    NaN
f    NaN
e    9.0
dtype: float64

In [73]:
print(serie_b)

b    0.0
d    1.0
a    2.0
c    3.0
f    4.0
e    5.0
dtype: float64

In [74]:
pd.Series(np.where(pd.isnull(serie_a),serie_b,serie_a),index=serie_a.index)

b    0.0
d    5.0
a    2.0
c    3.0
f    4.0
e    9.0
dtype: float64

In [75]:
serie_a.combine_first(serie_b)

b    0.0
d    5.0
a    2.0
c    3.0
f    4.0
e    9.0
dtype: float64